{"meta":{"title":"Neuroblog","subtitle":"","description":"","author":"AgeYY","url":"https://ageyy.github.io/neuroblog","root":"/neuroblog/"},"pages":[{"title":"Categories","date":"2020-09-09T09:41:47.422Z","updated":"2020-09-09T09:41:47.422Z","comments":true,"path":"categoties/index.html","permalink":"https://ageyy.github.io/neuroblog/categoties/index.html","excerpt":"","text":""}],"posts":[{"title":"Modeling of Simple Neural Network","slug":"biophysics","date":"2020-09-09T09:15:48.000Z","updated":"2020-10-15T07:18:25.104Z","comments":true,"path":"2020/09/09/biophysics/","link":"","permalink":"https://ageyy.github.io/neuroblog/2020/09/09/biophysics/","excerpt":"","text":"IntroductionResearches study our neural system in different levels: from conponentsof a single cell, such as membrane, to the connection of two cells(synapsis), and further to the complex network of the whole brain. Thissummary trying to find a straight pathway of the modeling fromsub-cellcular level to simple neural network. Please refer @mitcoursefor more detail in. MembraneMembrane has roughly two parts that are vital in the neural activity:phospholipid bilayer and channels (FIG. [structMemb]). phospholipid ispermeterbale for water, oil etc., yet impermmitable for ions. Thisattribution is similar to semi-permeable membrane. Ions carry charges,if the charge densities of the two sides of phospholipid bilayer (intracelluar space and extra-cellcular space) are different, there will be avotage across cell membrane (FIG. [semiMemb]). In all, because of theexistance of phospholipid bilayer, the cell has a function similar toconductance $$c V = Q \\label{capt}$$ where $c$ is the conductance per unit area, $Q$ is the charge densitydifferences and $V$ is the votage accross the cell. The votage of theextra-cellcular space is set to be zero, therefore $V$ here is also thevotage of intra-cellcular space, which is roughly $-70 \\text{mV}$ to$ -50 \\text{mV}$ as measured by the experiment. There are two types of channel: ion channels and metabolic channel. Theeffect of metabolic channels are more indirect and complex, which is notthe center concern of this summary. Ion channel behaviours as the gateof the membrane. It allows only certain types of ions to pass though themembrane, thus produce inward or outward cuurent flow. For example,Na-gated channel is only permitterble to Na$^+$, when the channel isopen (FIG. [nachannel]). One good approximation of the channel isresistence, govern by the Ohm’s law $$I = G_i (V - V_i) \\label{olm}$$ where $G_i$ is the conductance which can depends on the votage and time,and $V_i$ is the equivibrilum votage (constant for a certain type ofchannel) results from the balance of electric force and diffusion. Index$i$ here means $ith$ type of ion channel. Positive $I$ means outwardcurrent. Single CellDifferentiate on both side of equation ([capt]) and use equation([olm]), we have an equation for single cell $$c \\frac{dV}{dt} = - G_L (V - V_L) - I_e \\label{ifmodel}$$ where $I_e$ is the extra-induced current, such as the experimentistinject ions to the cell (negtive $I_e$). Index $L$ is leakage channel,which is a mathematically equvilent channel of partial function of sometypes of channel (largely fall into K-selective channel). The rest ofeffects of channels can be simplified as the following statement: If $V &gt; V_{th}$, $V = 50 \\text{mV}$, then quickly fall to $V_{res}$.[ifstate] This effect is often introduced by Na-selective channels. Typical valueof $V_{res}$ is $-65 mV$. There are some choices for $V_{th}$, butvalues like $-30mV$ is sufficient to fit a good result. When this statement istriggered, we say the neuron fired, or it made a spike. This single-cellmodel also be named Integrate and Firing Model. This model contains oneresistence (leakage channel), one conductance (membrane), one externalcurrent source ($I_e$), and voltage source (FIG. [ifmodel]). There arelots more sophiscated models, such as HH model, which replace thestatement with more realistic channels as additional terms in equation([ifmodel]). Equation [ifmodel] can be collected with a more susinct form $$\\tau \\frac{dV}{dt} = -V + V_{\\infty} \\label{ifmodelS}$$ where $\\tau = c / G_L$ and $V_{\\infty} = (V_L - I_e) / G_L$. If $G_L$here is a constant, solution of equation [ifmodelS] is $$V = (V_L - V_{\\infty}) e^{-t/\\tau} + V_{\\infty}$$ The firing pattern is shown in FIG. [fpattern] Information is stored in the firing rate of neurons instead of the exactvalue of votage. Firing rate is defined as the number of spiks in a unittime. The time spacing between two spikes can be calculated fromequation ([ifmodelS]) by calculate the time that $V$ grows from$V_{res}$ to $V_{th}$. The inverse of time spacing is firing rate, asshow in FIG. [fireate]. In all, we could conclude the relation with $$v = F[I_e] \\label{fireateeq}$$ where $v$ is the firing rate, and $F$ is some function has the shape inFIG. [fireate] SynapseBefore moving to neural network, we need to understand how two neuronsconnect each other by synapse. FIG. [syn] shows the biological structureof the synapse. When the pre-neuron is fired, the depolyzation will openthe Ca-channel, induces an inward flow of Ca$^{2+}$. This Ca$^{2+}$ willrelease the transmitters in the presynapse. Transmitter in the synapsecleft then attarch to particular recepters in the post-synapse, openion-channel to allow Na$^+$ flow into the post-synapse. This final leadto the depolyzation of the post-neuron. The current flow into the post-neuron can be descripted by $$I_{syn} = - G_{syn}(t) (V - V_{syn}), \\label{isyn}$$ where $V_{syn}$ is about $0$ mV, which is the reversal potential of thepost-synapse. Conductance $G_{syn}(t)$ is shown in FIG. [gsyn] Ifthere’s no transmitters in the synapse cleft, ion channels in thepost-synapse are closed, $G_{syn}(t) = 0$ mV. A spike of the presynapsewill suddenly release a large amount of transmitters, therefore largelyincrease $G_{syn}(t)$. Then the transmitters will graduatly eitherdiffuse away or be decomposed by glials, which lead to the slow decay ofthe conductance. The conductance induced by single spike is oftenapproximated by the exponential function $$K(t) = G_{max} e^{-t / \\tau}.$$ The whole conductance under a train of spikes is $$G(t) = \\sum_iK(t) \\delta_{t,t_i} \\label{spikeraw}$$ where there is a spike at time $t_i$. Equation ([spikeraw]) can besimplified with the spike train $S(t) = \\sum_i\\delta(t - t_i)$ $$G(t) = \\int{d\\tau}K(\\tau)S(t - \\tau)$$ Simple Neural NetworkConsider a network with only two neurons attarched FIG. [twonet]. Theworking status of each neuron is solely stated by its firing rate. So weneed to findout the firing-rate relation between neurons. For the singleneuron, the only source of external current is from its pre-neuron, i.e.$v = F[I_{syn}]$ from equation ([fireateeq]). Yet $I_{syn}$ followed byequation ([isyn]) is still too complex to be pratical. Hence we furtherthrow away the votage term, and treat $G_{syn}(t)$ as votageindependent, $$I_{syn} = \\int{d\\tau}K(\\tau)S(t - \\tau)$$ we could extract a factor $w$ so that the rest of$U(\\tau) = K(\\tau) / w$ can be normalized, $$\\int{d\\tau}U(\\tau) = 1$$ The convolution of a narrow (correnspond to short time of non-zero$K(\\tau)$) window $U(\\tau)$ with spike train $S(\\tau)$ is exactly thefiring rate of the presynapse $u$. Overall, we have $$v = F[w u].$$ This equation reveals the simple relation of the network. Larger $w$means the two neurons are more strongly connect, only a slow firing rateof the pre-neuron is enough for triggering the post-neuron. Thisbiologically could mean there are more channels in the post-synapse.Different presynapse will attarch to different sites of the postsynapse.Furthermore, the post-neual layer can also attarch to each other asshown in FIG. . The overall effect is the summation of all theircurrent. $$\\boldsymbol{v} = F[W\\boldsymbol{u} + M \\boldsymbol{v}],$$ where $W, M$ are matrices, arrays are written as bold letters. Thismodel is called rate model, which is the fundation of the lots of deeplearning architechture. ConclusionMembrane of the neuron is a conbination of resistor and capacity. Theconductances are different under different membrane and moreimportantly, different to different types of channels. This attributionallows the neuron to fire, and soon go back to the rest potential. Aspike from the pre-neuron will triggered a bit depolyzation of thepost-neuron. Once there is enough depolyzation, the post-neuron willalso make spikes. Despite the complicated procedure for generating aspike, the exact voltage is unimportant. The real information is storedin the frequency of the spikes, which can be described using a singlenumber – firing rate. By carefully simplify the synapse conductance, onecould obtain a relation between the firing rate of neurons, thus have aneuron network. This neuron network also lies in the basis current deepnetwork algorithms. 100 MIT OpenCourseWare: Introduction to NeuralComputation","categories":[{"name":"Review","slug":"Review","permalink":"https://ageyy.github.io/neuroblog/categories/Review/"}],"tags":[]}],"categories":[{"name":"Review","slug":"Review","permalink":"https://ageyy.github.io/neuroblog/categories/Review/"}],"tags":[]}